#+title: Workbook SBOM
#+options: toc: nil

#+caption: List of libraries
#+name: python-aggregation
#+BEGIN_SRC python 
  import json
  from pathlib import Path
  parent = Path('./target/classes/META-INF/sbom/application.cdx.json')
  return [[comp[k] for k in ('name', 'version')] + [comp.get('licenses',[{}])[0].get('license', {}).get('id', '')]
          for comp in json.loads(parent.read_text())['components']]
#+END_SRC

#+RESULTS: python-aggregation
| intens-db-service                             |                                     3.8.3 | Apache-2.0        |
| spring-boot-starter-data-jpa                  |                                     4.0.3 | Apache-2.0        |
| spring-boot-starter                           |                                     4.0.3 | Apache-2.0        |
| spring-boot-starter-logging                   |                                     4.0.3 | Apache-2.0        |
| logback-classic                               |                                    1.5.32 | EPL-2.0           |
| logback-core                                  |                                    1.5.32 | EPL-2.0           |
| log4j-to-slf4j                                |                                    2.25.3 | Apache-2.0        |
| log4j-api                                     |                                    2.25.3 | Apache-2.0        |
| jul-to-slf4j                                  |                                    2.0.17 | MIT               |
| spring-boot-autoconfigure                     |                                     4.0.3 | Apache-2.0        |
| spring-boot-starter-jdbc                      |                                     4.0.3 | Apache-2.0        |
| HikariCP                                      |                                     7.0.2 | Apache-2.0        |
| spring-boot-data-jpa                          |                                     4.0.3 | Apache-2.0        |
| spring-boot-data-commons                      |                                     4.0.3 | Apache-2.0        |
| spring-boot-persistence                       |                                     4.0.3 | Apache-2.0        |
| spring-data-commons                           |                                     4.0.3 | Apache-2.0        |
| spring-boot-hibernate                         |                                     4.0.3 | Apache-2.0        |
| spring-boot-jpa                               |                                     4.0.3 | Apache-2.0        |
| spring-orm                                    |                                     7.0.5 | Apache-2.0        |
| spring-data-jpa                               |                                     4.0.3 | Apache-2.0        |
| spring-tx                                     |                                     7.0.5 | Apache-2.0        |
| spring-aspects                                |                                     7.0.5 | Apache-2.0        |
| aspectjweaver                                 |                                  1.9.25.1 | EPL-2.0           |
| spring-boot-jdbc                              |                                     4.0.3 | Apache-2.0        |
| spring-boot                                   |                                     4.0.3 | Apache-2.0        |
| spring-boot-sql                               |                                     4.0.3 | Apache-2.0        |
| spring-boot-transaction                       |                                     4.0.3 | Apache-2.0        |
| spring-jdbc                                   |                                     7.0.5 | Apache-2.0        |
| spring-boot-starter-data-mongodb              |                                     4.0.3 | Apache-2.0        |
| spring-boot-starter-mongodb                   |                                     4.0.3 | Apache-2.0        |
| spring-boot-mongodb                           |                                     4.0.3 | Apache-2.0        |
| mongodb-driver-sync                           |                                     5.6.3 | Apache-2.0        |
| bson                                          |                                     5.6.3 | Apache-2.0        |
| mongodb-driver-core                           |                                     5.6.3 | Apache-2.0        |
| bson-record-codec                             |                                     5.6.3 | Apache-2.0        |
| spring-boot-data-mongodb                      |                                     4.0.3 | Apache-2.0        |
| spring-data-mongodb                           |                                     5.0.3 | Apache-2.0        |
| spring-boot-starter-web                       |                                     4.0.3 | Apache-2.0        |
| spring-boot-starter-jackson                   |                                     4.0.3 | Apache-2.0        |
| spring-boot-jackson                           |                                     4.0.3 | Apache-2.0        |
| jackson-databind                              |                                     3.0.4 | Apache-2.0        |
| jackson-core                                  |                                     3.0.4 | Apache-2.0        |
| spring-boot-starter-tomcat                    |                                     4.0.3 | Apache-2.0        |
| spring-boot-starter-tomcat-runtime            |                                     4.0.3 | Apache-2.0        |
| spring-boot-web-server                        |                                     4.0.3 | Apache-2.0        |
| tomcat-embed-core                             |                                   11.0.18 | Apache-2.0        |
| tomcat-embed-websocket                        |                                   11.0.18 | Apache-2.0        |
| spring-boot-tomcat                            |                                     4.0.3 | Apache-2.0        |
| spring-boot-http-converter                    |                                     4.0.3 | Apache-2.0        |
| spring-web                                    |                                     7.0.5 | Apache-2.0        |
| spring-boot-webmvc                            |                                     4.0.3 | Apache-2.0        |
| spring-boot-servlet                           |                                     4.0.3 | Apache-2.0        |
| spring-webmvc                                 |                                     7.0.5 | Apache-2.0        |
| spring-boot-starter-oauth2-resource-server    |                                     4.0.3 | Apache-2.0        |
| spring-boot-starter-security                  |                                     4.0.3 | Apache-2.0        |
| spring-boot-security                          |                                     4.0.3 | Apache-2.0        |
| spring-security-config                        |                                     7.0.3 | Apache-2.0        |
| spring-aop                                    |                                     7.0.5 | Apache-2.0        |
| spring-boot-security-oauth2-resource-server   |                                     4.0.3 | Apache-2.0        |
| spring-security-oauth2-jose                   |                                     7.0.3 | Apache-2.0        |
| spring-security-oauth2-core                   |                                     7.0.3 | Apache-2.0        |
| nimbus-jose-jwt                               |                                      10.4 | Apache-2.0        |
| spring-security-oauth2-resource-server        |                                     7.0.3 | Apache-2.0        |
| spring-boot-starter-validation                |                                     4.0.3 | Apache-2.0        |
| spring-boot-validation                        |                                     4.0.3 | Apache-2.0        |
| tomcat-embed-el                               |                                   11.0.18 | Apache-2.0        |
| hibernate-validator                           |                               9.0.1.Final | Apache-2.0        |
| springdoc-openapi-starter-webmvc-ui           |                                    2.8.14 | Apache-2.0        |
| springdoc-openapi-starter-webmvc-api          |                                    2.8.14 | Apache-2.0        |
| springdoc-openapi-starter-common              |                                    2.8.14 | Apache-2.0        |
| swagger-core-jakarta                          |                                    2.2.38 | Apache-2.0        |
| swagger-annotations-jakarta                   |                                    2.2.38 | Apache-2.0        |
| swagger-models-jakarta                        |                                    2.2.38 | Apache-2.0        |
| jackson-dataformat-yaml                       |                                    2.20.2 | Apache-2.0        |
| jackson-datatype-jsr310                       |                                    2.20.2 | Apache-2.0        |
| swagger-ui                                    |                                    5.30.1 | Apache-2.0        |
| webjars-locator-lite                          |                                     1.1.3 | MIT               |
| jasypt-spring-boot-starter                    |                                     3.0.5 | MIT               |
| jasypt-spring-boot                            |                                     3.0.5 | MIT               |
| jasypt                                        |                                     1.9.3 | Apache-2.0        |
| joda-time                                     |                                    2.14.0 | Apache-2.0        |
| spring-core                                   |                                     7.0.5 | Apache-2.0        |
| commons-logging                               |                                     1.3.5 | Apache-2.0        |
| micrometer-registry-prometheus                |                                    1.16.3 | Apache-2.0        |
| jspecify                                      |                                     1.0.0 | Apache-2.0        |
| micrometer-core                               |                                    1.16.3 | Apache-2.0        |
| micrometer-commons                            |                                    1.16.3 | Apache-2.0        |
| micrometer-observation                        |                                    1.16.3 | Apache-2.0        |
| HdrHistogram                                  |                                     2.2.2 | CC0-1.0           |
| LatencyUtils                                  |                                     2.0.3 | CC0-1.0           |
| prometheus-metrics-core                       |                                     1.4.3 | Apache-2.0        |
| prometheus-metrics-model                      |                                     1.4.3 | Apache-2.0        |
| prometheus-metrics-config                     |                                     1.4.3 | Apache-2.0        |
| prometheus-metrics-tracer-common              |                                     1.4.3 | Apache-2.0        |
| prometheus-metrics-exposition-formats         |                                     1.4.3 | Apache-2.0        |
| prometheus-metrics-exposition-textformats     |                                     1.4.3 | Apache-2.0        |
| metrics-core                                  |                                    4.2.37 | Apache-2.0        |
| slf4j-api                                     |                                    2.0.17 | MIT               |
| h2                                            |                                   2.4.240 | MPL-2.0           |
| commons-lang3                                 |                                    3.19.0 | Apache-2.0        |
| spring-security-core                          |                                     7.0.3 | Apache-2.0        |
| spring-security-crypto                        |                                     7.0.3 | Apache-2.0        |
| spring-beans                                  |                                     7.0.5 | Apache-2.0        |
| spring-context                                |                                     7.0.5 | Apache-2.0        |
| spring-expression                             |                                     7.0.5 | Apache-2.0        |
| spring-security-web                           |                                     7.0.3 | Apache-2.0        |
| therapi-runtime-javadoc                       |                                    0.15.0 | Apache-2.0        |
| byte-buddy                                    |                                    1.17.8 | Apache-2.0        |
| jackson-databind                              |                                    2.20.2 | Apache-2.0        |
| jackson-annotations                           |                                      2.20 | Apache-2.0        |
| jackson-core                                  |                                    2.20.2 | Apache-2.0        |
| jakarta.xml.bind-api                          |                                     4.0.4 | BSD-3-Clause      |
| jakarta.activation-api                        |                                     2.1.4 | BSD-3-Clause      |
| jaxb-impl                                     |                                     4.0.6 | BSD-3-Clause      |
| jaxb-core                                     |                                     4.0.6 | BSD-3-Clause      |
| angus-activation                              |                                     2.0.3 | BSD-3-Clause      |
| guava                                         |                                33.5.0-jre | Apache-2.0        |
| failureaccess                                 |                                     1.0.3 | Apache-2.0        |
| listenablefuture                              | 9999.0-empty-to-avoid-conflict-with-guava | Apache-2.0        |
| error_prone_annotations                       |                                    2.41.0 | Apache-2.0        |
| j2objc-annotations                            |                                       3.1 | Apache-2.0        |
| hibernate-processor                           |                               7.2.4.Final | Apache-2.0        |
| hibernate-core                                |                               7.2.4.Final | Apache-2.0        |
| jakarta.persistence-api                       |                                     3.2.0 | EPL-2.0           |
| jakarta.transaction-api                       |                                     2.0.1 | EPL-2.0           |
| classmate                                     |                                     1.7.3 | Apache-2.0        |
| jakarta.inject-api                            |                                     2.0.1 | Apache-2.0        |
| hibernate-models                              |                                     1.0.1 | Apache-2.0        |
| jandex                                        |                                     3.3.2 | Apache-2.0        |
| jaxb-runtime                                  |                                     4.0.6 | BSD-3-Clause      |
| jaxb-core                                     |                                     4.0.6 | BSD-3-Clause      |
| txw2                                          |                                     4.0.6 | BSD-3-Clause      |
| istack-commons-runtime                        |                                     4.1.2 | BSD-3-Clause      |
| jakarta.validation-api                        |                                     3.1.1 | Apache-2.0        |
| jakarta.annotation-api                        |                                     3.0.0 | EPL-2.0           |
| antlr4-runtime                                |                                    4.13.2 | BSD-3-Clause      |
| jboss-logging                                 |                               3.6.2.Final | Apache-2.0        |
| drools-core                                   |                                    10.1.0 | Apache-2.0        |
| kie-api                                       |                                    10.1.0 | Apache-2.0        |
| kie-internal                                  |                                    10.1.0 | Apache-2.0        |
| kie-util-xml                                  |                                    10.1.0 | Apache-2.0        |
| drools-wiring-api                             |                                    10.1.0 | Apache-2.0        |
| drools-base                                   |                                    10.1.0 | Apache-2.0        |
| drools-util                                   |                                    10.1.0 | Apache-2.0        |
| drools-wiring-static                          |                                    10.1.0 | Apache-2.0        |
| drools-io                                     |                                    10.1.0 | Apache-2.0        |
| commons-codec                                 |                                    1.19.0 | Apache-2.0        |
| drools-compiler                               |                                    10.1.0 | Apache-2.0        |
| drools-drl-parser                             |                                    10.1.0 | Apache-2.0        |
| drools-drl-extensions                         |                                    10.1.0 | Apache-2.0        |
| drools-drl-ast                                |                                    10.1.0 | Apache-2.0        |
| drools-kiesession                             |                                    10.1.0 | Apache-2.0        |
| kie-memory-compiler                           |                                    10.1.0 | Apache-2.0        |
| drools-ecj                                    |                                    10.1.0 | Apache-2.0        |
| ecj                                           |                                    3.33.0 | EPL-2.0           |
| kie-util-maven-support                        |                                    10.1.0 | Apache-2.0        |
| antlr-runtime                                 |                                     3.5.2 |                   |
| drools-mvel                                   |                                    10.1.0 | Apache-2.0        |
| mvel2                                         |                               2.5.2.Final | Apache-2.0        |
| drools-wiring-dynamic                         |                                    10.1.0 | Apache-2.0        |
| drools-commands                               |                                    10.1.0 | Apache-2.0        |
| totp                                          |                                     1.7.1 | MIT               |
| core                                          |                                     3.4.0 | Apache-2.0        |
| javase                                        |                                     3.4.0 | Apache-2.0        |
| jcommander                                    |                                      1.72 | Apache-2.0        |
| jai-imageio-core                              |                                     1.4.0 |                   |
| liquibase-core                                |                                     5.0.1 |                   |
| opencsv                                       |                                    5.12.0 | Apache-2.0        |
| snakeyaml                                     |                                       2.5 | Apache-2.0        |
| jaxb-api                                      |                                     2.3.1 | CDDL-1.1          |
| commons-collections4                          |                                     4.5.0 | Apache-2.0        |
| commons-text                                  |                                    1.14.0 | Apache-2.0        |
| commons-io                                    |                                    2.20.0 | Apache-2.0        |
| org.eclipse.jgit                              |                      7.4.0.202509020913-r | BSD-3-Clause      |
| JavaEWAH                                      |                                     1.2.3 | Apache-2.0        |
| workbook                                      |                                     3.8.3 | Apache-2.0        |
| intens-db-service-dashboard                   |                                     1.3.3 |                   |
| spring-boot-starter-actuator                  |                                     4.0.3 | Apache-2.0        |
| spring-boot-starter-micrometer-metrics        |                                     4.0.3 | Apache-2.0        |
| spring-boot-micrometer-metrics                |                                     4.0.3 | Apache-2.0        |
| spring-boot-micrometer-observation            |                                     4.0.3 | Apache-2.0        |
| spring-boot-actuator-autoconfigure            |                                     4.0.3 | Apache-2.0        |
| spring-boot-actuator                          |                                     4.0.3 | Apache-2.0        |
| spring-boot-health                            |                                     4.0.3 | Apache-2.0        |
| micrometer-jakarta9                           |                                    1.16.3 | Apache-2.0        |
| spring-boot-starter-liquibase                 |                                     4.0.3 | Apache-2.0        |
| spring-boot-liquibase                         |                                     4.0.3 | Apache-2.0        |
| micrometer-tracing                            |                                     1.6.3 | Apache-2.0        |
| context-propagation                           |                                     1.2.1 | Apache-2.0        |
| aopalliance                                   |                                       1.0 |                   |
| micrometer-tracing-bridge-otel                |                                     1.6.3 | Apache-2.0        |
| opentelemetry-api                             |                                    1.55.0 | Apache-2.0        |
| opentelemetry-context                         |                                    1.55.0 | Apache-2.0        |
| opentelemetry-common                          |                                    1.55.0 | Apache-2.0        |
| opentelemetry-semconv                         |                                    1.37.0 | Apache-2.0        |
| opentelemetry-sdk-common                      |                                    1.55.0 | Apache-2.0        |
| opentelemetry-sdk-trace                       |                                    1.55.0 | Apache-2.0        |
| opentelemetry-sdk                             |                                    1.55.0 | Apache-2.0        |
| opentelemetry-extension-trace-propagators     |                                    1.55.0 | Apache-2.0        |
| opentelemetry-exporter-otlp                   |                                    1.55.0 | Apache-2.0        |
| opentelemetry-sdk-metrics                     |                                    1.55.0 | Apache-2.0        |
| opentelemetry-sdk-logs                        |                                    1.55.0 | Apache-2.0        |
| opentelemetry-exporter-otlp-common            |                                    1.55.0 | Apache-2.0        |
| opentelemetry-exporter-common                 |                                    1.55.0 | Apache-2.0        |
| opentelemetry-exporter-sender-okhttp          |                                    1.55.0 | Apache-2.0        |
| okhttp-jvm                                    |                                     5.2.1 | Apache-2.0        |
| okio-jvm                                      |                                    3.16.1 | Apache-2.0        |
| kotlin-stdlib                                 |                                    2.2.21 | Apache-2.0        |
| annotations                                   |                                      13.0 | Apache-2.0        |
| opentelemetry-sdk-extension-autoconfigure-spi |                                    1.55.0 | Apache-2.0        |
| derbyclient                                   |                                 10.16.1.1 | Apache-2.0        |
| derbyshared                                   |                                 10.16.1.1 | Apache-2.0        |
| mariadb-java-client                           |                                     3.5.7 | LGPL-2.1-or-later |
| mysql-connector-j                             |                                     9.6.0 |                   |
| postgresql                                    |                                   42.7.10 | BSD-2-Clause      |
| checker-qual                                  |                                    3.52.0 | MIT               |
| mssql-jdbc                                    |                              13.2.1.jre11 | MIT               |
| spring-boot-configuration-processor           |                                     4.0.3 | Apache-2.0        |
